// Exercise #1: Decrease the Student Scores
// Exercise #1: Decrease the Student Scores

// สมมุติว่าเรามี Variable ตั้งต้น studentScores ซึ่งบรรจุข้อมูลของคะแนนสอบของนักเรียนห้องหนึ่ง ดังนี้ [89, 70, 60, 50, 100, 71]
// วันหนึ่งครูได้ออกมาประกาศว่า ครูตรวจข้อสอบผิดไป 1 ข้อ
// โดยเป็นข้อที่ทุกคนทำผิดหมดทุกคนเลย แต่ครูดันให้เป็นถูก ซึ่งข้อนี้มีคะแนน 10 คะแนน
// ดังนั้นครูจะหักคะแนนของทุกคนในชั้นเรียนนี้ออกมาทั้งหมด 10 คะแนน จากคะแนนที่ได้ทั้งหมด
// ให้เขียนโปรแกรมในการหักคะแนนของนักเรียนชั้นนี้ออกมาคนละ 10 คะแนน

let scores = [89, 70, 60, 50, 100, 71];
for (let i = 0; i < scores.length; i++)
{
    scores[i] = scores[i] - 10;
};
console.log(scores);
// Start coding here
